In [1]:
import numpy as np
import pandas as pd

In [9]:
dataFrame = pd.read_excel("maas.xlsx")  ## excelden okuma

In [10]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atil   100  40.0    Yazılım
1     Zeynep   150  50.0      Satis
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [11]:
dataFrame.fillna("dolduruldu")

  Unnamed: 0  Maas         Yas   Departman
0       Atil   100        40.0     Yazılım
1     Zeynep   150        50.0       Satis
2     Mehmet   200        30.0  dolduruldu
3      Ahmet    50        10.0   Pazarlama
4      Atlas   150  dolduruldu      Finans
5      Fatma   200        25.0       Hukuk

In [12]:
doluDegerlerDF = dataFrame.dropna()

In [13]:
doluDegerlerDF

  Unnamed: 0  Maas   Yas  Departman
0       Atil   100  40.0    Yazılım
1     Zeynep   150  50.0      Satis
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [14]:
doluDegerlerDF.to_excel("yenimaas.xlsx")   ## excele yazma

In [15]:
## read_csv excelin başka bir format halinin okunması
## to_csv excelin başka bir format halinin yazılması